app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)
    #@restaurant.set_cuisince_code(@restaurant.cuisine_name)

    respond_to do |format|
      if @restaurant.save
---
INSERT INTO "restaurants" ("restaurant_name", "cuisine", "rating", "address", "created_at", "updated_at", "is_ten_bis") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @restaurant.destroy
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 9]]