app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("user_name", "remark", "rating", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_name", "Avigail"], ["remark", "I was hungry at the end"], ["rating", 2], ["restaurant_id", 1], ["created_at", "2017-09-24 07:29:01.789133"], ["updated_at", "2017-09-24 07:29:01.789133"]]
UPDATE "restaurants" SET "rating" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["rating", 4], ["updated_at", "2017-09-24 10:28:30.750842"], ["id", 1]]
---
  def create
    @review = Review.new(review_params)
    begin
      @review.save!
      @restaurant = @review.restaurant
      if @restaurant.nil?
        invalid_restaurant
      end
      @restaurant.update_rating